Show / Hide Table of Contents
Class ResultOfIncrement
Result of internal forces in the one position
Inheritance
System.Object
ResultOfIncrement
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfIncrement
Properties
Improve this Doc   View Source
AxialForce
Axial force
Declaration
public double AxialForce { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AxialStrain
Axial strain
Declaration
public double AxialStrain { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AxialStress
Axial stress
Declaration
public double AxialStress { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Increment
Increment of load case
Declaration
public int Increment { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source